{
    "intro": {
        "presentation": "Hi, I'm Josh",
        "job": "Computer science major, ",
        "intro": " software developer, and curious innovator"
    },
    "experience": "Projects & Experience",
    "cards": {
        "etymomap": "React web app to explore the etymology of the English language. Powered by OpenAI and Merriam-Webster.",
        "jPhotos": "Full-stack, self-hosted, secure photo cloud-storage solution. Users can upload, view, and delete their personal photos.",
        "retroPi": "Retro-gaming emulation interface where users can load and play a large library of games from a variety of platforms. Designed for Raspberry Pi.",
        "marioCalculator": "Fully-functional Android calculator inspired by Super Mario Bros. (1985) for the NES.",
        "jWave": "Mobile and web platform for users to download and stream music for free. Powered by Telegram API to interface with DeezLoaderBot.",
        "java_card": "Application for client and order management, with role assignment system using JPA with Hibernate, and MySQL relational database."
    },
    "jobs": {
        "gruv": {
            "organization": "Gruv Media",
            "time": "July 2023 - Present",
            "position": "Web Developer",
            "bullet1": "Develop websites and web applications using React, Django, Wagtail, PHP, Wordpress, JavaScript, and Stripe.",
            "bullet2": "Utilize and maintain server technologies including Apache, CPanel, PostgreSQL, fail2ban, ClamAV, Git + GitHub, Bash scripting, and more.",
            "bullet3": "Communicate effectively with clients and management to ensure timely and exceptional project delivery.",
            "bullet4": "Collaborate with fellow developers and IT to efficiently solve problems and devise optimal solutions and workflows."
        },
        "tdw": {
            "organization": "3DWestern",
            "time": "December 2024 - Present",
            "position": "Full-stack Developer",
            "bullet1": "Working with a team of follow Western students to build and deploy a web application to process 3D-printing orders.",
            "bullet2": "Project is currently in the planning phase, and will involve a variety of technologies, including a frontend JavaScript framework, server backend, databases, and payment gateway API."
        }
    },
    "education": "Education",
    "education_items": {
        "student": {
            "title": "BSc. Computer Science",
            "time": "September 2022 - April 2026",
            "university": "University of Western Ontario",
            "major": "Honours Specialization in Computer Science + Minor in Software Engineering",
            "courses": "Data Structures & Algorithms, Machine Learning, Artificial Intelligence, Object-Oriented Programming, Systems Programming, Operating Systems, Computer Architecture"
        },
        "certificate": {
            "title": "AWS Cloud Practitioner Certificate",
            "time": "December 2024",
            "provider": "Amazon Web Services (AWS).",
            "description": "Certified understanding of AWS cloud tools and infrastructure, including EC2 server-hosting, networking, databases, and more.",
            "button": "View Certification"
        }
    },
    "skills": "Skills",
    "skill_items": {
        
    },
    "contact": "Contact",
    "placeholder": {
        "email": "your@email.com",
        "pretext": "Want to get in touch? Leave your email address and message below, and I'll get back to you as soon as I can.",
        "text": "Write your message here...",
        "button": {
            "send": "Send Message",
            "sending": "Sending...",
            "sent": "Message Sent!"
        }
    },
    "resume": "/resume.pdf",
    "about": "About",
    "about_items": {
        "paragraph1" : "As a computer science student at the University of Western Ontario, I am quite passionate about technology and math. In each of my courses, I aim to achieve as high of a GPA as possible and seek to squeeze as much as possible out of my courses. My favourite courses so far have been Computer Architecture, Theory of Computation, and Machine Learning.",
        "image1" : {
            "src" : "westerncampus.jpg",
            "caption" : "Western University Campus"
        },
        "paragraph2" : "In the field of computer science, I am captivated by a wide variety of topics. Since my first year, I have been working remotely as a web developer, where I have built and deployed a handful of websites and full-stack applications. This job has exposed me to many different front-end and back-end frameworks, and has taught me good development practices, collaboration, and IT skills. I am currently working with the 3DWestern team to develop a full-stack app to process 3D-printing orders. Aside from web development, I am becoming increasingly interested in cryptography. I have begun self-studying various fundamentals of cryptography, and am considering pursuing a Masters degree related to quantum cryptography.",
        "image2" : {
            "src" : "dataquest.jpg",
            "caption" : "Working on a machine-learning model for Western's DataQuest hackathon"
        },
        "paragraph3" : "I am also an open-source software enthusiast. I run Arch Linux on my computer, GrapheneOS on my Pixel phone, and have my own physical Debian Linux server which I host this website on, along with various projects. In my free time I enjoy reading books and playing video games. My favourite genre of books to read are historical-biographical books; I am currently reading American Sphinx: The Character of Thomas Jefferson by Joseph Ellis. eWhen I am stressed, I partake in hiking, archery, and going to the gym in order to decompress",
        "image3" : {
            "src" : "komoka.jpg",
            "caption" : "Hiking Photo from Komoka Provincial Park"
        }
    }

  }
  